receivemail/src/main/resources/com/archermind/txtbl/receiver/mail/prop/loginRequest.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" 
          xmlns:wsse="http://schemas.xmlsoap.org/ws/2003/06/secext"
          xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion"
          xmlns:wsp="http://schemas.xmlsoap.org/ws/2002/12/policy"
          xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
          xmlns:wst="http://schemas.xmlsoap.org/ws/2004/04/trust">
    <Header>
        <ps:AuthInfo xmlns:ps="http://schemas.microsoft.com/Passport/SoapServices/PPCRL" Id="PPAuthInfo">
            <ps:HostingApp> </ps:HostingApp>
            <ps:BinaryVersion>2</ps:BinaryVersion>
            <ps:UIVersion> </ps:UIVersion>
            <ps:Cookies />
            <ps:RequestParams> </ps:RequestParams>
        </ps:AuthInfo>
        <wsse:Security xmlns="http://schemas.xmlsoap.org/ws/2004/04/trust">
            <wsse:UsernameToken Id="user">
                <wsse:Username>{username}</wsse:Username>
                <wsse:Password>{password}</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </Header>
    <Body>
        <ps:RequestMultipleSecurityTokens xmlns:ps="http://schemas.microsoft.com/Passport/SoapServices/PPCRL" Id="RSTS">
            <wst:RequestSecurityToken xmlns="http://schemas.xmlsoap.org/ws/2002/04/secext">
                <wst:RequestType>http://schemas.xmlsoap.org/ws/2004/04/security/trust/Issue</wst:RequestType>
                <wsp:AppliesTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
                    <wsa:EndpointReference>
                        <wsa:Address>http://Passport.NET/tb</wsa:Address>
                    </wsa:EndpointReference>
                </wsp:AppliesTo>
            </wst:RequestSecurityToken>
            <wst:RequestSecurityToken xmlns="http://schemas.xmlsoap.org/ws/2002/04/secext">
                <wst:RequestType>http://schemas.xmlsoap.org/ws/2004/04/security/trust/Issue</wst:RequestType>
                <wsp:AppliesTo xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing">
                    <wsa:EndpointReference>
                        <wsa:Address>mws.beta.mobile.live.com</wsa:Address>
                    </wsa:EndpointReference>
                </wsp:AppliesTo>
                <wsse:PolicyReference URI="NFS_90DAY_10_SAML" />
            </wst:RequestSecurityToken>
        </ps:RequestMultipleSecurityTokens>
    </Body>
</Envelope>